CSI API ETABS v1

# cDesignShearWallGetRebarPrefsPier Method

---

Retrieves data from the Rebar Selection Rules for Wall Piers

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetRebarPrefsPier(
    	int Item,
    	ref string Value
    )

    Function GetRebarPrefsPier (
    	Item As Integer,
    	ByRef Value As String
    ) As Integer

    Dim instance As cDesignShearWall
    Dim Item As Integer
    Dim Value As String
    Dim returnValue As Integer

    returnValue = instance.GetRebarPrefsPier(Item,
    	Value)

    int GetRebarPrefsPier(
    	int Item,
    	String^% Value
    )

    abstract GetRebarPrefsPier :
            Item : int *
            Value : string byref -> int

#### Parameters

Item

    Type: SystemInt32
An integer value corresponding to the data to be retrieved, from the following
list

  1. Vertical Bars - Unconfined Zones - Smallest Bar Size
  2. Vertical Bars - Unconfined Zones - Largest Bar Size
  3. Vertical Bars - Unconfined Zones - Preferred Corner/Joint Bar Size
  4. Vertical Bars - Unconfined Zones - Preferred Middle Bar Size
  5. Vertical Bars - Unconfined Zones - Minimum Spacing of Bars
  6. Vertical Bars - Unconfined Zones - Maximum Spacing of Bars
  7. Vertical Bars - Confined Zones - Smallest Bar Size
  8. Vertical Bars - Confined Zones - Largest Bar Size
  9. Vertical Bars - Confined Zones - Preferred Corner/Joint Bar Size
  10. Vertical Bars - Confined Zones - Preferred Middle Bar Size
  11. Vertical Bars - Confined Zones - Minimum Spacing of Bars
  12. Vertical Bars - Confined Zones - Maximum Spacing of Bars
  13. Transverse Bars - Unconfined Zones - Smallest Bar Size
  14. Transverse Bars - Unconfined Zones - Largest Bar Size
  15. Transverse Bars - Unconfined Zones - Preferred Bar Size
  16. Transverse Bars - Unconfined Zones - Minimum Spacing of Bars
  17. Transverse Bars - Unconfined Zones - Maximum Spacing of Bars
  18. Transverse Bars - Unconfined Zones - Preferred Bar Arrangement
  19. Transverse Bars - Confined Zones - Smallest Bar Size
  20. Transverse Bars - Confined Zones - Largest Bar Size
  21. Transverse Bars - Confined Zones - Preferred Bar Size
  22. Transverse Bars - Confined Zones - Minimum Spacing of Bars
  23. Transverse Bars - Confined Zones - Maximum Spacing of Bars
  24. Transverse Bars - Confined Zones - Preferred Bar Arrangement

Value

    Type: SystemString
The retrieved data; note that numerical values are converted to String

If the Item is one of the Preferred Bar Arrangement options, then this value
will be an integer from the following list:

  1. Straight
  2. UAndStraight
  3. Hoops

#### Return Value

Type: Int32
Returns zero if the data is successfully retrieved; otherwise returns non-zero

See Also

#### Reference

cDesignShearWall Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com